{
    "matthew-ammerman": {
        "slug": "matthew-ammerman",
        "firstName": "Matthew",
        "lastName": "Ammerman",
        "bio": "Matt brings over a decade of technology-related customer implementation and development experience to his role as Apprenda’s VP of Client Services. Matt joined Sinclair Schuller and Abraham Sultan in 2005 to initiate R&D efforts on the Apprenda platform. Today, Matt leads Apprenda’s client services team, which drives implementation and customization of Apprenda for customers around the world.",
        "sessions": [
            "building-scalable-data-based-windows-mobile-apps"
        ]
    },
    "steve-bohlen": {
        "slug": "steve-bohlen",
        "firstName": "Steve",
        "lastName": "Bohlen",
        "bio": "Currently a Senior Software Engineer for the SpringSource division of VMware where he is the Technical Lead and Community Evangelist for the Spring.NET Framework, Stephen brings his varied 18-year-plus experience in software and technology to the design and delivery of Software Engineering Solutions and Frameworks for other Software Engineers. In addition to his work on Spring.NET, Stephen is also an active contributor to several other .NET Open-Source Software projects including NHibernate, NDbUnit, and others. Stephen is also a current and past Microsoft MVP award recipient, a member of the ASP Insiders and Visual C# Insiders, and presently holds the office of the Vice President for INETA, North America.",
        "twitter": {
            "href": "http://twitter.com/sbohlen",
            "title": "sbohlen"
        },
        "sessions": [
            "refactoring-to-a-solid-foundation"
        ]
    },
    "chris-bowen": {
        "slug": "chris-bowen",
        "firstName": "Chris",
        "lastName": "Bowen",
        "bio": "[Chris Bowen](http://blogs.msdn.com/cbowen) is a Principal Developer Evangelist with Microsoft, specializing in web technologies and working with customers and companies in the northeastern US. An architect and developer with over 18 years in the industry, he joined Microsoft after holding senior positions at companies such as Monster.com, VistaPrint, Staples, and IDX Systems. He is coauthor of \"Essential Windows Communication Foundation\" and \"Professional Visual Studio 2005 Team System\" and holds an M.S. in Computer Science and a B.S. in Management Information Systems, both from Worcester Polytechnic Institute.",
        "twitter": {
            "href": "http://twitter.com/chrisbowen",
            "title": "chrisbowen"
        },
        "sessions": [
            "windows-8-development"
        ]
    },
    "dan-bowles": {
        "slug": "dan-bowles",
        "firstName": "Dan",
        "lastName": "Bowles",
        "bio": "Developer on the Web Architecture Team at [Dealer.com](http://www.dealer.com/).  Passionate about a faster, more awesome Web.",
        "twitter": {
            "href": "http://twitter.com/danbowles",
            "title": "danbowles"
        },
        "sessions": [
            "learning-to-love-javascript"
        ]
    },
    "steve-boylan": {
        "slug": "steve-boylan",
        "firstName": "Steve",
        "lastName": "Boylan",
        "bio": "A grizzled veteran of the software industry, from coding PL/1 on punched cards and Z-80s with cassette tapes to the latest and greatest modern frameworks.",
        "sessions": [
            "unit-testing"
        ]
    },
    "dave-burke": {
        "slug": "dave-burke",
        "firstName": "Dave",
        "lastName": "Burke",
        "bio": "Dave Burke is founder of Sueetie LLC, home of the [Sueetie Open Source Social Networking Framework](http://sueetie.com/).",
        "twitter": {
            "href": "http://twitter.com/daveburkevt",
            "title": "daveburkevt"
        },
        "sessions": [
            "get-your-application-game-on"
        ]
    },
    "rene-churchill": {
        "slug": "rene-churchill",
        "firstName": "Rene",
        "lastName": "Churchill",
        "bio": "Rene has been programming in a wide variety of languages for over 20 years, including using PHP as far back as v3.0 in 1998. He provides consulting services as Astute Computing and is a partner in a local information venture, [WherezIt.com](http://www.wherezit.com/).",
        "sessions": [
            "sql-basics"
        ]
    },
    "john-cicilio": {
        "slug": "john-cicilio",
        "firstName": "John",
        "lastName": "Cicilio",
        "bio": "John Cicilio works as a Senior Software Engineer at [MyWebGrocer](http://www.mywebgrocer.com/). He has been working in systems and software for 30 years. John is a Certified Microsoft Professional developer and has a passion for science, mathematics and technology. \"When I met my first Pascal compiler, it was love. I truly enjoy the full wonder of the history or science and mathematics and feel fortunate to be a part of this great human adventure in computation and abstract knowledge systems.\"",
        "sessions": [
            "mathematica"
        ]
    },
    "christian-cote": {
        "slug": "christian-cote",
        "firstName": "Christian",
        "lastName": "Coté",
        "bio": "Christian Coté is an IT professional with more than 14 years of experience working on business intelligence projects. Before SSIS was released, Christian developed ETL processes using a range of tools on multiple platforms. Christian has been a presenter at a number of conferences and code camps. He currently co-leads the SQL Server PASS chapter in Montréal.",
        "twitter": {
            "href": "http://twitter.com/Christian_SQL",
            "title": "Christian_SQL"
        },
        "sessions": [
            "powerpivot-2012"
        ]
    },
    "adrian-del-maestro": {
        "slug": "adrian-del-maestro",
        "firstName": "Adrian",
        "lastName": "Del Maestro",
        "bio": "I am a condensed matter theorist at the University of Vermont where I apply high performance computational techniques to investigate the effects of strong correlations, dissipation and disorder on quantum matter. I teach a course on scientific computing with python and have been using it in my own research since 2003.",
        "twitter": {
            "href": "http://twitter.com/agdelma",
            "title": "agdelma"
        },
        "sessions": [
            "scientific-computing-with-python"
        ]
    },
    "kathleen-dollard": {
        "slug": "kathleen-dollard",
        "firstName": "Kathleen",
        "lastName": "Dollard",
        "bio": "Kathleen Dollard is .NET Coach for Crystal MEF Lab. She has been a Microsoft MVP since 1998 and has given hundreds of speeches around the world. She has worked extensively with compositional architectures in relation to specific development platforms. Her experience includes HTML5/JavaScript, Silverlight, and WPF in both C# and Visual Basic. She’s interested in making core .NET technologies available to all coders to enable them to write better software faster and in helping programmers be more efficient in how they use tools – including Visual Studio. Kathleen is also a long-time advocate of generative techniques and is the author of Code Generation in Microsoft .NET (from Apress). She has published numerous articles on a range of .NET technologies. Kathleen is active in the Northern Colorado .NET SIG, the Denver Visual Studio User Group, and the Northern Colorado Architect's Group.",
        "twitter": {
            "href": "http://twitter.com/kathleendollard",
            "title": "kathleendollard"
        },
        "sessions": [
            "dot-net-framework-and-principles"
        ]
    },
    "paul-flint": {
        "slug": "paul-flint",
        "firstName": "Paul",
        "lastName": "Flint",
        "bio": "Paul Flint, of Barre, Vermont is employed as the System Administrator for the Vermont Department of Labor Enterprise Computing System. Prior to his current engagement in the Vermont State government, he was, just over a quarter of a century an independent technical consultant, security analyst, author and inventor with professional experience in higher education, engineering, systems network design, security architecture, broadcast management and appraisal. Mr. Flint's has experience and publications in the areas of Higher Education, Broadcast, Military, Government, Research, Education and Commercial Information Assurance. Additionally, Paul Flint possesses an extensive background in system administration, new media management, engineering, evaluation and appraisal. He was born in Washington, DC but is now content in Vermont with his wife, her cats, and phone calls from the grown up kids. He can be contacted via email at [flint@flint.com](mailto:flint@flint.com). Visit his web site at [http://www.flint.com](http://www.flint.com).",
        "sessions": [
            "arduino"
        ]
    },
    "mike-fowler": {
        "slug": "mike-fowler",
        "firstName": "Mike",
        "lastName": "Fowler",
        "bio": "Mike Fowler is a frontend developer and designer currently working at MyWebGrocer in Burlington, Vermont. He is passionate about web standards; clean, semantic code; minimalist, usable design; and excellent user experiences. He tweets @[michaelrfowler](http://twitter.com/michaelrfowler) and blogs at [http://mikefowler.me](http://mikefowler.me).",
        "twitter": {
            "href": "http://twitter.com/michaelrfowler",
            "title": "michaelrfowler"
        },
        "sessions": [
            "crafting-scaleable-stylesheets"
        ]
    },
    "rob-friesel": {
        "slug": "rob-friesel",
        "firstName": "Rob",
        "lastName": "Friesel",
        "bio": "Rob Friesel is a Senior User Interface Developer at [Dealer.com](http://www.dealer.com/), a JavaScript pedant, an occasional polyglot, and a reluctant composer of CSS; I blog at [blog.founddrama.net](blog.founddrama.net).",
        "twitter": {
            "href": "http://twitter.com/founddrama",
            "title": "founddrama"
        },
        "sessions": [
            "headless-javascript-bdd"
        ]
    },
    "jeffrey-fritz": {
        "slug": "jeffrey-fritz",
        "firstName": "Jeffrey",
        "lastName": "Fritz",
        "bio": "",
        "twitter": {
            "href": "http://twitter.com/csharpfritz",
            "title": "csharpfritz"
        },
        "sessions": [
            "event-sourcing-and-read-model-projections"
        ]
    },
    "ryan-gardner": {
        "slug": "ryan-gardner",
        "firstName": "Ryan",
        "lastName": "Gardner",
        "bio": "Senior java developer at [Dealer.com](http://www.dealer.com/). Member of the jsr107 (java temporary caching) expert group.",
        "twitter": {
            "href": "http://twitter.com/ryebrye",
            "title": "ryebrye"
        },
        "sessions": [
            "performance-testing-and-tuning"
        ]
    },
    "john-garland": {
        "slug": "john-garland",
        "firstName": "John",
        "lastName": "Garland",
        "bio": "John is a Senior Consultant at Wintellect and has been developing software professionally since the 1990's, with work ranging from high-performance sports video and statistical analysis tools to business applications for retail, environmental, financial, and medical organizations. His work has been featured at several Microsoft tradeshow events, including keynote addresses. John lives in New Hampshire, where he is active participant in the development community and has delivered technical presentations throughout New England for both community and Microsoft-sponsored events. John is a graduate of the University of Florida and holds Microsoft Certifications spanning Windows, Silverlight, Windows Phone, and Windows Azure.",
        "twitter": {
            "href": "http://twitter.com/dotnetgator",
            "title": "dotnetgator"
        },
        "sessions": [
            "taking-the-cloud-with-you"
        ]
    },
    "geoff-golder": {
        "slug": "geoff-golder",
        "firstName": "Geoff",
        "lastName": "Golder",
        "bio": "After dropping out of a computer science program 8 years ago \"because he didn't want to be a code monkey,\" Geoff has become an independent code monkey. He is always striving to work less and do things in the simplest way possible.",
        "sessions": [
            "high-performance-json-web-api"
        ]
    },
    "vincent-grondin": {
        "slug": "vincent-grondin",
        "firstName": "Vincent",
        "lastName": "Grondin",
        "bio": "I have over 14 years of experience in the software development field and I've been using .NET in enterprise projects over 9 years now. I was involved in many enterprise projects for large corporations like Desjardins, Domtar, Cascades and Alcoa but I was also part of a few projects for various government branches. I like to learn new technologies related to .NET, use the new tools that are designed for .NET and I love to share it all with my peers. Yes, I'm a confessed .NET addict and I'm currently working at Fujitsu as a Senior Consultant and received an MVP award in C# from Microsoft.",
        "sessions": [
            "software-design-solutions"
        ]
    },
    "jason-haley": {
        "slug": "jason-haley",
        "firstName": "Jason",
        "lastName": "Haley",
        "bio": "Jason Haley is an Independent Consultant in the New England area.",
        "twitter": {
            "href": "http://twitter.com/haleyjason",
            "title": "haleyjason"
        },
        "sessions": [
            "going-independent"
        ]
    },
    "bradley-holt": {
        "slug": "bradley-holt",
        "firstName": "Bradley",
        "lastName": "Holt",
        "bio": "Bradley Holt is a web developer, entrepreneur, non-profit board member, free/open source software contributor, community facilitator, speaker, and an author. He is the co-founder of [Found Line](http://foundline.com/), a creative studio with capabilities in web development, web design, and print design. He is a Board Member at [Vermont Community Access Media](http://www.vermontcam.org/) (VCAM)—a non-profit community media and technology center—and the [Burlington Web Application Group](http://www.btvwag.org/) (BTVWAG). He is a member of the [Telecommunications Advisory Committee](http://www.btacvt.com/) for the [City of Burlington](http://www.ci.burlington.vt.us/), Vermont where his role is to advise the City Council on matters related to [Burlington Telecom](http://www.burlingtontelecom.net/), a municipally owned telecommunications services provider. He is a minor contributor of source code, bug reports, or documentation to several free/open source projects including [PHP](http://php.net/) and [Zend Framework](http://framework.zend.com/). He organizes the [Burlington, Vermont PHP Users Group](http://groups.google.com/group/burlington-vt-php) and is a co-organizer of [Vermont Code Camp](http://vtcodecamp.org/) as well as the [Northeast PHP Conference](http://www.northeastphp.org/). He has spoken at [SXSW Interactive](http://sxsw.com/interactive), [OSCON](http://www.oscon.com/), [OSCON Data](http://oscon.com/data), the [jQuery Conference](http://events.jquery.org/2011/boston/), [ZendCon](http://zendcon.com/), and [CouchConf](http://www.couchbase.com/couchconf-nyc). He is the author of [*Writing and Querying MapReduce Views in CouchDB*](http://oreilly.com/catalog/9781449303129/) and [*Scaling CouchDB*](http://oreilly.com/catalog/9781449303129/), both published by O'Reilly Media. He blogs at [bradley-holt.com](http://bradley-holt.com/) and can be found on Twitter as @[BradleyHolt](http://twitter.com/BradleyHolt).",
        "twitter": {
            "href": "http://twitter.com/BradleyHolt",
            "title": "BradleyHolt"
        },
        "sessions": [
            "domain-driven-design"
        ]
    },
    "joe-kuemerle": {
        "slug": "joe-kuemerle",
        "firstName": "Joe",
        "lastName": "Kuemerle",
        "bio": "Joe Kuemerle is a developer and speaker in the Cleveland, OH area specializing in .NET development, security, database and application lifecycle topics. He is currently a Lead Developer at BookingBuilder Technologies. Joe is active in the technical community as well as a speaker at local, regional and national events.",
        "twitter": {
            "href": "http://twitter.com/jkuemerle",
            "title": "jkuemerle"
        },
        "sessions": [
            "data-encryption-with-sql-server"
        ]
    },
    "robert-levy": {
        "slug": "robert-levy",
        "firstName": "Robert",
        "lastName": "Levy",
        "bio": "A long-time fan of Lisp as well as functional programming, I have specialized professionally in Clojure in recent years, including various free software contributions and personal projects, a large-scale mobile content adaptation platform at Akamai, and now high-performance PV energy monitoring and data processing systems at Draker Labs.",
        "twitter": {
            "href": "http://twitter.com/rplevy",
            "title": "rplevy"
        },
        "sessions": [
            "clojure"
        ]
    },
    "brian-lloyd-newberry": {
        "slug": "brian-lloyd-newberry",
        "firstName": "Brian",
        "lastName": "Lloyd-Newberry",
        "bio": "Brian Lloyd-Newberry is a Principal on the Framework Team at Dealer.com. He spends his time in a mixture of architecture, dev ops, mentoring and technical advocacy. He has been working with Java and the JVM since before Y2K and has over 15 years of software engineering experience across many industries, languages and platforms. Over the past several years he has focused on performance analysis and troubleshooting large distributed systems where tipping points happen in seconds. Brian is passionate about performance and wants all developers to completely understand how their applications perform at runtime.",
        "twitter": {
            "href": "http://twitter.com/brianln",
            "title": "brianln"
        },
        "sessions": [
            "understanding-when-and-why-things-are-broken"
        ]
    },
    "everett-mckay": {
        "slug": "everett-mckay",
        "firstName": "Everett",
        "lastName": "McKay",
        "bio": "Everett McKay is the principal of [UX Design Edge](http://www.uxdesignedge.com/), a user experience design training and consulting firm based in St. Albans, Vermont. UX Design Edge's flagship course is [UX Design Essentials Workshop](http://www.uxdesignworkshop.com/), a two-day onsite course where your team members can improve their UX design skills \"by doing\" by redesigning your own app or site. UX Design Edge is offering a three-day [UX Design Essentials](http://www.uxdesignessentials.com/) class in Burlington on October 15 - 17. Previously, Everett was a program manager at Microsoft on the Windows 7 and Windows Vista teams, and was responsible for the Windows User Experience Interaction Guidelines.",
        "twitter": {
            "href": "http://twitter.com/uxdesignedge",
            "title": "uxdesignedge"
        },
        "sessions": [
            "do-not-design-like-a-programmer"
        ]
    },
    "kendall-miller": {
        "slug": "kendall-miller",
        "firstName": "Kendall",
        "lastName": "Miller",
        "bio": "Kendall Miller is one of the founding partners of Gibraltar Software, an Independent Software Vendor (ISV) that develops & markets commercial applications for .NET developers. Introduced commercially in 2009, Gibraltar is an application logging & monitoring platform that is currently used by customers around the world from individual consultants through Fortune 100 companies and governments. Before starting Gibraltar Software, Kendall worked for multiple startups leading their technology development from beginning through profitability. In each case he's focused on translating enterprise-level performance and capabilities down to smaller companies.",
        "twitter": {
            "href": "http://twitter.com/kendallmiller",
            "title": "kendallmiller"
        },
        "sessions": [
            "creating-your-own-software-company",
            "scaling-systems"
        ]
    },
    "eric-smith": {
        "slug": "eric-smith",
        "firstName": "Eric",
        "lastName": "Smith",
        "bio": "Eric Smith is Technology Director at EatingWell Media Group. He has been programming for more than 30 years and managing development projects since 1995.",
        "twitter": {
            "href": "http://twitter.com/eric_s_smith",
            "title": "eric_s_smith"
        },
        "sessions": [
            "functional-programming"
        ]
    },
    "nat-woodard": {
        "slug": "nat-woodard",
        "firstName": "Nat",
        "lastName": "Woodard",
        "bio": "Senior designer/agent of change - web architecture team at [Dealer.com](http://www.dealer.com/).",
        "sessions": [
            "content-first"
        ]
    }
}